# DoubleWallMaterialArea Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..DoubleWallMaterialArea Property
FabricationPart Class See Also
---
The double wall material area of the fabrication part. If the fabrication part is not double walled, returns zero.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public double DoubleWallMaterialArea { get; }
```

Visual Basic
---
```text
Public ReadOnly Property DoubleWallMaterialArea As Double
	Get
```

Visual C++
---
```text
public:
property double DoubleWallMaterialArea {
	double get ();
}
```

# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace